Ryan365Apps/spotify-knob/firmware/knob/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16 MB flash, custom table with room for OTA later
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 8 MB octal PSRAM - album art cannot exist without this
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# HTTPS to Spotify without pinning certificates by hand
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# Dynamic mbedTLS buffers are deliberately OFF (2026-09-03). They are meant to
# save RAM by allocating TLS buffers only while they are needed, but with this
# workload - one long-lived connection polled every few seconds - roughly 5-7 KB
# went missing per request and never came back, taking the device from 80 KB
# free to 5 KB in two minutes. The failing allocation named the culprit:
# "Dynamic Impl: alloc(4437 bytes) failed". Fixed buffers cost more at rest and
# are constant, which is the trade this device wants: it holds one connection
# for days. Do not re-enable without measuring free heap over ten minutes.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=n

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# Wave 3: wifi/ip event handlers live on this task; default 2304 overflowed
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Wave 3 checkpoint E / Wave 9: QR codes on the panel
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_FONT_MONTSERRAT_20=y
